RIET/src/Tasks/УниверсальнаяЗадача/УниверсальнаяЗадача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>УниверсальнаяЗадача</name>
  <addressing>InformationRegister.АдресацияУведомлений</addressing>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>EnumRef.ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУтверждения</name>
    <type>
      <types>EnumRef.СтатусыУтвержденияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗадачи</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>АналитикаАдресации</name>
    <type>
      <types>CatalogRef.PayableCentres</types>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

RIET/src/InformationRegisters/АдресацияУведомлений/АдресацияУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АдресацияУведомлений</name>
  <resources>
    <name>КоличествоУтверждающих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПраваПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаАдресации</name>
    <type>
      <types>CatalogRef.PayableCentres</types>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Tasks/УниверсальнаяЗадача/Forms/ФормаСпискаУправляемая/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Заместитель = ПолучитьЗаместителя();
	Если Заместитель = ТекПользователь Тогда 
		Элементы.СнятьЗаместителя.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаместителя()
	
	//Проверить принадлежность к исполнителям и ответственным лицам
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АдресацияУведомлений.Исполнитель
	|ИЗ
	|	РегистрСведений.АдресацияУведомлений КАК АдресацияУведомлений
	|ГДЕ
	|	АдресацияУведомлений.ОтветственноеЛицо = &ТекущийПользователь
	|	И АдресацияУведомлений.ОтветственноеЛицо <> АдресацияУведомлений.Исполнитель");
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекПользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Исполнитель;
	иначе
		Возврат ТекПользователь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаместительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ИзменениеЗаместителяНаСервере(ТекПользователь, ВыбранноеЗначение) Тогда 
		Заместитель = ВыбранноеЗначение;
		Элементы.СнятьЗаместителя.Видимость = ?(Заместитель = ТекПользователь, Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////
// КОМАНДА - СНЯТЬ ЗАМЕСТИТЕЛЯ

&НаКлиенте
Процедура СнятьЗаместителя(Команда)
	
	Если ИзменениеЗаместителяНаСервере(ТекПользователь, ТекПользователь) Тогда 
		Заместитель = ТекПользователь;
		Элементы.СнятьЗаместителя.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменениеЗаместителяНаСервере(ТекПользователь, Исполнитель)
	 		
	Набор = РегистрыСведений.АдресацияУведомлений.СоздатьНаборЗаписей();
	Набор.Отбор.ОтветственноеЛицо.Установить(ТекПользователь);
	Набор.Прочитать();
	Для каждого СтрокаНабора из Набор Цикл
		СтрокаНабора.Исполнитель = Исполнитель;
	КонецЦикла;
	
	Попытка
		Набор.Записать();
		Возврат Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось снять заместителя: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;	
	
КонецФункции
